Tekla.Structures.ModelInternal.BimModelDataProduct.CurieParser
Parses a CURIE (Compact Uniform Resource Identifier) string into its components.

Tekla.Structures.ModelInternal.BimModelDataProduct.CurieParser.ParseCurie(System.String)
Parses a CURIE string into a CurieResult object containing the type and identifier.
curie: The CURIE string to parse
Returns: The parsed CURIE object